app/controllers/cines_controller.rb

  def index
    @cines = Cine.all
---
SELECT "cines".* FROM "cines"

  def create
    @cine = Cine.new(cine_params)

    respond_to do |format|
      if @cine.save
---
INSERT INTO "cines" ("name", "theater_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cine Colombia"], ["theater_id", 1], ["created_at", "2015-03-26 14:12:32.908842"], ["updated_at", "2015-03-26 14:12:32.908842"]]

  def destroy
    @cine.destroy
---
DELETE FROM "cines" WHERE "cines"."id" = ?  [["id", 1]]

    def set_cine
      @cine = Cine.find(params[:id])
---
SELECT  "cines".* FROM "cines" WHERE "cines"."id" = ? LIMIT 1  [["id", 1]]