app/controllers/compras_controller.rb

  def index
    @compras = Compra.all
---
SELECT "compras".* FROM "compras"