app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
  def index
    @favorites = Favorite.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
      #@user = User.find_by id: params[:id]
      @user = User.find_by id: params[:id]

INSERT INTO "favorites" ("movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["movie_id", 1], ["user_id", 1], ["created_at", "2015-04-29 19:53:38.693414"], ["updated_at", "2015-04-29 19:53:38.693414"]]
---
  def create
    @u = Favorite.where(user_id: favorite_params[:user_id])

    if !@u.exists?(movie_id: favorite_params[:movie_id])
      @favorite = Favorite.new(favorite_params)

      respond_to do |format|
        if @favorite.save

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]
---
  def destroy
    @favorite.destroy

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_favorite
      @favorite = Favorite.find(params[:id])