app/controllers/funtions_controller.rb

  def index
    @funtions = Funtion.all
---
SELECT "funtions".* FROM "funtions"

  def create
    @funtion = Funtion.new(funtion_params)

    respond_to do |format|
      if @funtion.save
---
INSERT INTO "funtions" ("movie_id", "sala", "hora", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["movie_id", 1], ["sala", "4"], ["hora", "2015-03-27 18:30:00.000000"], ["created_at", "2015-03-27 22:00:36.213724"], ["updated_at", "2015-03-27 22:00:36.213724"]]

    def set_funtion
      @funtion = Funtion.find(params[:id])
---
SELECT  "funtions".* FROM "funtions" WHERE "funtions"."id" = ? LIMIT 1  [["id", 1]]