app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "sinopsis", "clasificacion", "image", "calificacion", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "image" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image", "http://www.cinemaldito.com/wp-content/uploads/2013/07/Corazón-de-león.jpg"], ["updated_at", "2015-03-27 20:35:59.715905"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)