app/controllers/theaters_controller.rb

  def index
    @theaters = Theater.all
---
SELECT "theaters".* FROM "theaters"