app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "a@gmail.com"], ["password", "123456"], ["created_at", "2015-04-22 20:38:37.945240"], ["updated_at", "2015-04-22 20:38:37.945240"]]
---
def create
        @user = User.new register_params

        if @user.save